In [2]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame()

In [5]:
df

Empty DataFrame
Columns: []
Index: []

In [6]:
books = [
    {
        "title":  "Book 1",
        "author": "Author 1"
    },
    {
        "title":  "Book 2",
        "author": "Author 2"
    },
    
]

In [14]:
dff = pd.DataFrame(books)
dff

    title    author
0  Book 1  Author 1
1  Book 2  Author 2

In [9]:
np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades})

type(df)

pandas.core.frame.DataFrame

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
name       12 non-null object
math       12 non-null int64
english    12 non-null int64
reading    12 non-null int64
dtypes: int64(3), object(1)
memory usage: 512.0+ bytes

In [12]:
df.index, df.columns

(RangeIndex(start=0, stop=12, step=1),
 Index(['name', 'math', 'english', 'reading'], dtype='object'))

In [13]:
df.describe()

            math    english    reading
count  12.000000  12.000000  12.000000
mean   84.833333  77.666667  86.500000
std    11.134168  13.371158   9.643651
min    62.000000  62.000000  67.000000
25%    78.500000  63.750000  80.750000
50%    90.000000  77.500000  89.000000
75%    92.250000  86.750000  93.250000
max    98.000000  99.000000  98.000000

In [15]:
dff['quantity'] = [10, 20]

In [20]:
dff['price'] = [25, 12]

In [21]:
dff

    title    author  quantity  price
0  Book 1  Author 1        10     25
1  Book 2  Author 2        20     12

In [23]:
dff["inventory_value"] = dff.price * dff.quantity

In [24]:
dff

    title    author  quantity  price  inventory_value
0  Book 1  Author 1        10     25              250
1  Book 2  Author 2        20     12              240

In [27]:
dff[["quantity", "title"]]

   quantity   title
0        10  Book 1
1        20  Book 2

In [28]:
dff.T

                        0         1
title              Book 1    Book 2
author           Author 1  Author 2
quantity               10        20
price                  25        12
inventory_value       250       240

In [29]:
y = dff.copy()

In [30]:
y

    title    author  quantity  price  inventory_value
0  Book 1  Author 1        10     25              250
1  Book 2  Author 2        20     12              240